# Meter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Meter Property
SymbolTypeId Class See Also
---
Symbol m, indicating unit Meters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Meter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Meter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Meter {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace